blueant-soap-c/Linux/BaseBinding.createUser.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
    xmlns:SOAP-ENV="http://www.w3.org/2003/05/soap-envelope"
    xmlns:SOAP-ENC="http://www.w3.org/2003/05/soap-encoding"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:ns2="http://exception.blueant.axis.proventis.net/"
    xmlns:ns1="http://blueant.axis.proventis.net/"
    xmlns:ns3="http://base.blueant.axis.proventis.net/">
 <SOAP-ENV:Body>
   <ns3:createUserRequestParameter>
    <ns3:sessionID></ns3:sessionID>
    <ns3:personID>0</ns3:personID>
    <ns3:username></ns3:username>
    <ns3:passwort></ns3:passwort>
    <ns3:permissionGroups>
     <ns3:ID>0</ns3:ID>
    </ns3:permissionGroups>
    <ns3:accessFrom>1999-12-31</ns3:accessFrom>
    <ns3:accessTo>1999-12-31</ns3:accessTo>
    <ns3:licenseType>named</ns3:licenseType>
    <ns3:foreignKeyList>
     <ns3:ForeignKey>
      <ns3:foreignID></ns3:foreignID>
      <ns3:foreignSystem></ns3:foreignSystem>
     </ns3:ForeignKey>
    </ns3:foreignKeyList>
   </ns3:createUserRequestParameter>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
